Documents/МатериальнаяПомощь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>МатериальнаяПомощь</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПодписания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_МатериальнаяПомощь</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СписокГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выписано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/МатериальнаяПомощь/Forms/ФормаДокумента/Ext/Form/Module.bsl
Функция ПолучитьПараметрыСтудента(Студент) Экспорт
	 СписокПараметров = Новый Структура;
	 СписокПараметров.Вставить("ИНН", Студент.ИНН);
	 Возврат СписокПараметров;
 КонецФункции
 
&НаКлиенте
Процедура МатериальнаяПомощьФИОПриИзменении(Элемент)
	Парам = ПолучитьПараметрыСтудента(Элементы.МатериальнаяПомощь.ТекущиеДанные.ФИО);
	Элементы.МатериальнаяПомощь.ТекущиеДанные.ИНН = Парам.ИНН;
	Элементы.МатериальнаяПомощь.ТекущиеДанные.Выписано = ИСТИНА;
КонецПроцедуры
